Revit 2027 API
APIObject.Dispose Method
Causes the object to release immediately any resources it may be utilizing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Dispose()
Public Sub Dispose
public:
virtual void Dispose() sealed
abstract Dispose : unit -> unit
override Dispose : unit -> unit
Implements
IDisposable.Dispose()
Remarks
This method is usually called implicitly by the programming language when the object is destroyed. After calling this method the object will no longer work correctly.
See Also
Reference
APIObject Class
Autodesk.Revit.DB Namespace